Wind_Dune_Egmond/Run_in_a_usual_computer_notebook/run_angle80/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    front
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          1245;
        startFace       155308;
        matchTolerance  0.0001;
        neighbourPatch  Back;
        transformType   translational;
        separation      (0 0 -300);
    }
    Back
    {
        type            cyclic;
        inGroups        List<word> 1(cyclic);
        nFaces          1245;
        startFace       156553;
        matchTolerance  0.0001;
        neighbourPatch  front;
        transformType   translational;
        separation      (0 0 300);
    }
    inlet
    {
        type            patch;
        nFaces          920;
        startFace       157798;
    }
    outlet
    {
        type            patch;
        nFaces          800;
        startFace       158718;
    }
    upperPatch
    {
        type            patch;
        nFaces          400;
        startFace       159518;
    }
    ground
    {
        type            wall;
        inGroups        List<word> 
2
(
groundGroup
wall
)
;
        nFaces          7462;
        startFace       159918;
    }
)

// ************************************************************************* //
